{
  "title": "Home | next-i18next",
  "pages": {
    "index": {
      "tabTitle": "Главная страница",
      "pageTitle": "Кратко",
      "description": "Привет, Я Егор. Работаю фронтенд-разработчиком более 6 лет. Мой основной стек используемых технологий состоит из JS, TS, React, Web3. В качестве стейт-менеджера я использую Redux, MobX, Zustand.\n\nНачал я с аутстафф компании, где проработал 3 года. Эта компания продавала меня другим крупным компаниям на 3 или 4 месяца. Я работал во многих сферах, таких как банковский сектор, маркетплейсы, интернет-магазины. В каждом проекте были разные фронтенд-команды. Некоторые из них были большими, в их состав входили тимлид, 2 сеньора/мидл разработчика из фронтенд-части, в некоторых проектах я был единственным разработчиком, в некоторых — работал с партнером. Мой уровень по этим проектам был middle или middle+, потому что в большинстве проектах уже была реализована архитектура. Да, я так же создал несколько проектов с нуля и поддерживал их в будущем. Но, как я понимаю, у меня недостаточно опыта, чтобы с нуля делать хорошую и строгую архитектуру во всякого рода проектах под ключ.\n\nВторая часть моего фронтенд-пути была продуктовая компания из криптосферы. Это был TruePNL. Я проработал в нем 2 года. Я создал и поддерживал несколько проектов. Это что-то вроде экосистемы. Я работал в трёх из них. Флагманский проект — Launchpad. Я разработал его с нуля. Моя команда была маленькой, что-то вроде стартапа. Наша команда разработчиков состояла из одного бэкэнд-разработчика NodeJs, одного фронтенд-разработчика (меня) и продукт менеджера/COO, который разрабатывал для нас смарт-контракты на Soludity.\nНаш проект работает в сетях Binance Smart Chain, Polygon и Ethereum. Взаимодействие с блокчейном осуществляется через кошелек Metamask. Я использовал библиотеки web3 и web3-react. Стек технологий - React, TS, кастомный стейт менеджер работает через контекст и хуки, выглядит как redux, но проще и короче. NEXT с locales(i18n) без какой-либо логики ssr. У меня не было достаточно времени, чтобы его настроить. У нас не было юнит или модульных тестов, но у нас было открытое вознаграждение за тестирование, несколько ручных тестировщиков, работающих на полставки.\nУ нас есть свой токен. Это Pnl и еще один внутренний токен проекта Pnlg. Вы можете застейкать свой PNL или использовать его для входа в пулы. Последняя функция, которую я реализовал, — это логика для проектов типов nft, но, насколько я знаю, они ее еще не выпустили. Мы работали по Scrum, двухнедельным спринтам и очень гибкому рабочему процессу.\n\nИ третья часть и на данный момент актуальная, это работа в интернациональной компании, так же из крипто сферы. В данной компании проработал больше года. Разрабатывал и поддерживал DEX агрегатор для экосистемы Cosmos. В отличие от предыдущего проекта Launchpad(TruePNL), этот проект уже был реализован другими разработчиками и мне приходилось поддерживать его и расширять функционалом. На данном проекте кроме взаимодействия с уже знакомым Metamask так же познакомился и поддерживал работу с такими кошельками как Keplr, Station Wallet, Cosmostation Wallet, Leap Wallet. DEX работает с более 100 сетей(Terra, Osmosis, Juno, Stargaze, Injective и др.) и одной из основных задач было имплементация их в проект и дальнейшая корректная работа во всех частях терминала. Платформа включает в себя межсетевые переводы с поддержкой IBC протокола, SWAP обмен токенами между блокчейнами и NFT-маркейтплейс часть функционала которого так же была добавлена мной. Для коммуникации использовался английский язык. Так же работали по двухнедельным спринтам с очень гибким рабочим днем.\n\nУчитывая весь мой опыт, который у меня сейчас есть, я ищу продуктовую интернациональную компанию или аутсорс со строгой структурой и дорожной картой. Так как я поработал на аутстаффе и в стартапе, теперь мне хочется чего-то более структурированного и фундаментального. Большая или средняя команда, в которой будут несколько senior разработчиков, возможно, с тимлидом. Я хочу прокачать свои навыки в построение архитектуры проекта и по возможности продолжить работу с web3.",
      "toPosts": "Go to Posts"
    },
    "404": {
      "pageTitle": "404 Page",
      "description": "404. Page not found",
      "button": "На Главную"
    }
  },
  "layout": {
    "header": {
      "title": ".Header"
    },
    "menu": {
      "someWords": "Обо мне",
      "allPosts": "Пример SSG",
      "linkedin": "Linked",
      "hh": "hh",
      "cv": ".DOCX"
    },
    "footer": {
      "title": ".Footer"
    }
  }
}